app/controllers/api/v1/locations_controller.rb

SELECT `locations`.* FROM `locations` WHERE (lat >= 0.0 AND lat <= 0.0 AND lng >= -117.352592828516 AND lng <= -117.009270074609 ) LIMIT 50
---
  def index
    radius = params[:radius] || 200
    limit = params[:limit] || 100
    if params[:point] # use the geo gem that doesn't support AReL ;(
      @locations = Location.near(params[:point], radius, { :limit => limit, :include => [:ratings] }) # include ratings is not working
    else
      @locations = Location.scoped
      @locations = @locations.limit(limit)
      @locations = @locations.where("city = ?", params[:city])  if params[:city]
      @locations = @locations.in_bounds(params[:bounds])        if params[:bounds]
    end
    logger.info { "NUMBER OF RESULTS #{@locations.length}" }
  end

  def region
    render :text => "foo"
  end

  # GET /locations/1
  # GET /locations/1.xml
  def show
    @location = Location.find(params[:id])

    # @json = @location.bounding_box