app/controllers/api/v1/ratings_controller.rb

  def index
    comments = []
    if params[:location_id]
      comments = Comment.where("commentable_id = ?", params[:location_id]).reverse
---
SELECT `comments`.* FROM `comments` WHERE (commentable_id = '1933') ORDER BY created_at ASC

  def create
    # logger.info { "RatingsController.create #{params.inspect}" }
    logger.info { "RatingsController.create comment is #{params[:comment]}  #{params[:location_id]}" }
    if params[:location_id]
      @location = Location.find( params[:location_id] )
---
INSERT INTO `comments` (`comment`, `commentable_id`, `commentable_type`, `created_at`, `title`, `updated_at`, `user_id`) VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT `locations`.* FROM `locations` WHERE `locations`.`id` = ? LIMIT 1  [["id", "1933"]]