app/controllers/locations_controller.rb

  def show
    @location = Location.find(params[:id])
---
SELECT `locations`.* FROM `locations` WHERE `locations`.`id` = ? LIMIT 1  [["id", "1775"]]

  def new
    @location = Location.new
    @tricks   = Trick.all
---
SELECT `tricks`.* FROM `tricks`

  def edit
    @location = Location.find(params[:id])
---
SELECT `locations`.* FROM `locations` WHERE `locations`.`id` = ? LIMIT 1  [["id", "1775"]]

  def update
    @location = Location.find(params[:id])
---
SELECT `locations`.* FROM `locations` WHERE `locations`.`id` = ? LIMIT 1  [["id", "1775"]]