app/controllers/tricks_controller.rb

SELECT `tricks`.* FROM `tricks`
---
  def index
    @tricks = Trick.all