app/views/locations/show.html.erb


	<% unless @location.images.empty? %>
---
SELECT `images`.* FROM `images` WHERE `images`.`location_id` = 1775